/*
 * B. Выборы в США
 *
 * Ограничение времени - 2 секунды
 * Ограничение памяти - 64Mb
 * Ввод - стандартный ввод или input.txt
 * Вывод - стандартный вывод или output.txt
 *
 * Как известно, в США президент выбирается не прямым голосованием, а путем двухуровневого голосования. Сначала проводятся выборы в каждом штате и определяется победитель выборов в данном штате. Затем проводятся государственные выборы: на этих выборах каждый штат имеет определенное число голосов — число выборщиков от этого штата. На практике, все выборщики от штата голосуют в соответствии с результатами голосования внутри штата, то есть на заключительной стадии выборов в голосовании участвуют штаты, имеющие различное число голосов. Вам известно за кого проголосовал каждый штат и сколько голосов было отдано данным штатом. Подведите итоги выборов: для каждого из участника голосования определите число отданных за него голосов.
 *
 * Формат ввода
 * Каждая строка входного файла содержит фамилию кандидата, за которого отдают голоса выборщики этого штата, затем через пробел идет количество выборщиков, отдавших голоса за этого кандидата.
 *
 * Формат вывода
 * Выведите фамилии всех кандидатов в лексикографическом порядке, затем, через пробел, количество отданных за них голосов.
 * */

const { readFile } = require('fs/promises')
const { resolve } = require('path')

async function readInput(filePath) {
  const input = await readFile(resolve(__dirname, filePath), { encoding: 'utf8' })
  return input.trim().split('\n')
}

async function countVotes(...votes) {
  const results = {}
  for (let vote of votes) {
    const [candidate, count] = vote.split(' ')
    results[candidate] = results[candidate] ? results[candidate] + +count : +count
  }
  return Object.keys(results)
    .sort()
    .reduce((acc, candidate) => {
      acc.push(`${candidate} ${results[candidate]}`)
      return acc
    }, [])
    .join('\n')
}

;(async () => {
  console.log(await countVotes(...(await readInput('input.txt'))))
})()
